app/views/inventories/index.html.erb

                                    <%= form.label :owner_email, "Original Owner" %>
                                    <%= form.collection_select :owner_email, User.all, :id, :email, { prompt: "Select an owner" }, class: "form-control" %>
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "alice@example.com"], ["LIMIT", 1]]

  itemField.addEventListener('focus', function() {
    fetch('/items.json?page=$(page)')
      .then(response => response.json())
      .then(items => {
        var tableHTML = '<table class="table table-striped">';
        tableHTML += '<thead><tr><th>SKU</th><th>Name</th><th>Category</th></tr></thead>';
        tableHTML += '<tbody>';
        items.forEach(function(item) {
          tableHTML += '<tr data-item-id="' + item.item_id + '" data-item-name="' + item.name + '">';
          tableHTML += '<td>' + item.sku + '</td>';
          tableHTML += '<td>' + item.name + '</td>';
          tableHTML += '<td>' + item.category.name + '</td>';
          tableHTML += '</tr>';
        });
        tableHTML += '</tbody></table>';

        tableContainer.innerHTML = tableHTML;
        tableContainer.style.display = 'block';
        var rows = tableContainer.querySelectorAll('tr[data-item-id]');
        rows.forEach(function(row) {
          row.addEventListener('click', function() {
            var itemId = row.getAttribute('data-item-id');
            var itemName = row.getAttribute('data-item-name');
            itemField.value = itemName;
---
SELECT "items".* FROM "items" WHERE "items"."item_id" = ? LIMIT ?  [["item_id", "IT001"], ["LIMIT", 1]]

<script>
document.addEventListener('DOMContentLoaded', function () {
  var multiDeleteBtn = document.getElementById('multi-delete-btn');
  var multiDeleteModal = new bootstrap.Modal(document.getElementById('multiDeleteConfirmationModal'));
  var confirmMultiDeleteBtn = document.getElementById('confirm-multi-delete-btn');
  var selectedItemsList = document.getElementById('selected-items-list');

  multiDeleteBtn.addEventListener('click', function () {
    var selectedIds = [];

    document.querySelectorAll('.inventory-checkbox:checked').forEach(function (checkbox) {
      selectedIds.push(checkbox.value);
    });

    if (selectedIds.length === 0) {
      alert('Please select at least one item to delete.');
      return;
    }

    selectedItemsList.innerHTML = "";
    selectedIds.forEach(id => {
      let li = document.createElement('li');
---
SELECT "inventories".* FROM "inventories"