app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" ORDER BY "categories"."cat_id" ASC
---
     def index
          @categories = Category.order(:cat_id)

SELECT "categories".* FROM "categories" WHERE "categories"."cat_id" = ? LIMIT ?  [["cat_id", "1"], ["LIMIT", 1]]
---
     def show
          @category = Category.find(params[:cat_id])