app/controllers/departments_controller.rb

INSERT INTO "departments" ("id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["id", "0"], ["name", "Math"], ["created_at", "2025-02-14 00:00:18.737395"], ["updated_at", "2025-02-14 00:00:18.737395"]]
---
     def create
          @department = Department.new(department_params)

          respond_to do |format|
               if @department.save

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", "0"], ["LIMIT", 1]]
---
     def delete
          @department = Department.find(params[:id])

SELECT "departments".* FROM "departments" WHERE "departments"."id" = ? LIMIT ?  [["id", "0"], ["LIMIT", 1]]
DELETE FROM "departments" WHERE "departments"."id" = ?  [["id", "0"]]
---
     def destroy
          @department = Department.find(params[:id])
          @department.destroy