app/controllers/inventories_controller.rb

     def index
          @item = Item.new
          @inventory = Inventory.new
          @inventories = Inventory.includes(:item)
---
SELECT "inventories".* FROM "inventories" INNER JOIN "items" ON "items"."item_id" = "inventories"."item_id" WHERE (items.name LIKE '%hammer%')
SELECT "items".* FROM "items" WHERE "items"."item_id" = ? LIMIT ?  [["item_id", "test"], ["LIMIT", 1]]

     def create
          @inventory = Inventory.new(inventory_params)
          @inventory.user_email = nil if @inventory.user_email.blank?

          if @inventory.save
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "adf@g"], ["LIMIT", 1]]
INSERT INTO "inventories" ("item_id", "year_of_purchase", "location", "condition_of_item", "owner_email", "user_email", "sku", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

     def edit
          @inventory = Inventory.find(params[:id])
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."inv_id" = ? LIMIT ?  [["inv_id", 1], ["LIMIT", 1]]

     def update
          @inventory = Inventory.find(params[:id])
          if @inventory.update(inventory_params)
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."inv_id" = ? LIMIT ?  [["inv_id", 4], ["LIMIT", 1]]
UPDATE "inventories" SET "sku" = ?, "updated_at" = ? WHERE "inventories"."inv_id" = ?  [["sku", "EQP002"], ["updated_at", "2025-02-16 22:35:56.172426"], ["inv_id", 2]]

     def destroy
          @inventory.destroy
---
DELETE FROM "inventories" WHERE "inventories"."inv_id" = ?  [["inv_id", 4]]

     def set_inventory
          @inventory = Inventory.find(params[:id])
---
SELECT "inventories".* FROM "inventories" WHERE "inventories"."inv_id" = ? LIMIT ?  [["inv_id", 1], ["LIMIT", 1]]