app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "alice@example.com"], ["LIMIT", 1]]
---
  def set_user
    @user = User.find_by!(email: params[:email])