app/models/admin.rb

INSERT INTO "admins" ("email", "full_name", "uid", "avatar_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT ?  [["email", "suresh06192004@tamu.edu"], ["LIMIT", 1]]
---
     def self.from_google(email:, full_name:, uid:, avatar_url:)
          create_with(uid:, full_name:, avatar_url:).find_or_create_by!(email:)